# Reference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Reference Property
Curve Class See Also
---
Returns a stable reference to the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference Reference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Reference As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ Reference {
	Reference^ get ();
}
```

# ### Field Value
This value is set for curve geometry obtained from Revit elements. nullNothingnullptra null reference (Nothing in Visual Basic) if the curve was created via parameters, copying, transform, or other operations.
# Remarks
This value is also if the corresponding geometry object does not permit referencing.
# See Also
Curve Class
Autodesk.Revit.DB Namespace